# SAT 2012 Update

In [2]:
import pandas as pd

In [3]:
SAT = pd.read_json("https://data.cityofnewyork.us/resource/f9bf-2cp4.json")

In [13]:
SAT.applymap( lambda x: x.lower() if type(x) == str else x )

SAT.head()

,dbn,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,school_name
0,01M292,29,355,404,363,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1,01M448,91,383,423,366,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2,01M450,70,377,402,370,EAST SIDE COMMUNITY SCHOOL
3,01M458,7,414,401,359,FORSYTH SATELLITE ACADEMY
4,01M509,44,390,433,384,MARTA VALLE HIGH SCHOOL